Multisensor/Multisensor-NER-Mapping.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Multisensor NER Mapping</title>
<!-- 2014-11-19 Wed 19:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="vladimir.alexiev@ontotext.com" />
</head>
<body>
<div id="content">
<h1 class="title">Multisensor NER Mapping</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Prefixes</a></li>
<li><a href="#sec-2">2. Mapping</a></li>
<li><a href="#sec-3">3. Notes &amp; Todo <code>[0/4]</code></a>
<ul>
<li><a href="#sec-3-1">3.1. <span class="todo TODO">TODO</span> gender</a></li>
<li><a href="#sec-3-2">3.2. <span class="todo TODO">TODO</span> dc:type</a></li>
<li><a href="#sec-3-3">3.3. <span class="todo TODO">TODO</span> schema.org</a></li>
<li><a href="#sec-3-4">3.4. <span class="todo TODO">TODO</span> GoodRelations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prefixes</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
@prefix dbo:      &lt;http://dbpedia.org/ontology/&gt;.
@prefix dc:       &lt;http://purl.org/dc/elements/1.1/&gt;.
@prefix foaf:     &lt;http://xmlns.com/foaf/0.1/&gt;.
@prefix gr:       &lt;http://purl.org/goodrelations/v1#&gt;.
@prefix nerd:     &lt;http://nerd.eurecom.fr/ontology#&gt;.
@prefix nif:      &lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-core#&gt;.
@prefix rdau:     &lt;http://rdaregistry.info/Elements/u/&gt;.
@prefix time:     &lt;http://www.w3.org/2006/time#&gt;.
@prefix xsd:      &lt;http://www.w3.org/2001/XMLSchema#&gt;.
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mapping</h2>
<div class="outline-text-2" id="text-2">
<table border="1" cellspacing="0" cellpadding="0" rules="all" frame="box">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Class</b> /Property</th>
<th scope="col" class="left"><b>Type/enum</b></th>
<th scope="col" class="left"><b>Mapping</b></th>
<th scope="col" class="left"><b>Notes</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>all</b></td>
<td class="left">&#xa0;</td>
<td class="left">nif:Word or nif:Phrase</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">text</td>
<td class="left">string</td>
<td class="left">n/a</td>
<td class="left">nif:anchorOf omitted</td>
</tr>

<tr>
<td class="left">onset</td>
<td class="left">number</td>
<td class="left">nif:beginIndex</td>
<td class="left">start</td>
</tr>

<tr>
<td class="left">offset</td>
<td class="left">number</td>
<td class="left">nif:endIndex</td>
<td class="left">end</td>
</tr>

<tr>
<td class="left"><b>Person</b></td>
<td class="left">&#xa0;</td>
<td class="left">dbo:Person, foaf:Person, nerd:Person</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">firstname</td>
<td class="left">string</td>
<td class="left">foaf:firstName</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">lastname</td>
<td class="left">string</td>
<td class="left">foaf:lastName</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">gender</td>
<td class="left">masculine, feminine</td>
<td class="left">rdau:gender</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">occupation</td>
<td class="left">string</td>
<td class="left">rdau:professionOrOccupation</td>
<td class="left">not dbo:occupation, which is a node (dbo:PersonFunction)</td>
</tr>

<tr>
<td class="left"><b>Location</b></td>
<td class="left">type=other</td>
<td class="left">dbo:Location, nerd:Location</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Location</b></td>
<td class="left">type=country</td>
<td class="left">dbo:Country, nerd:Country</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Location</b></td>
<td class="left">type=region</td>
<td class="left">dbo:Region, nerd:AdministrativeRegion</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Location</b></td>
<td class="left">type=city</td>
<td class="left">dbo:City, nerd:City</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Location</b></td>
<td class="left">type=street</td>
<td class="left">dbo:Street, nerd:Location</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Organisation</b></td>
<td class="left">type=institution</td>
<td class="left">dbo:Organisation, foaf:Organization, nerd:Organization</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Organisation</b></td>
<td class="left">type=company</td>
<td class="left">dbo:Company, foaf:Company, nerd:Company</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Product</b></td>
<td class="left">&#xa0;</td>
<td class="left">nerd:Product</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">type</td>
<td class="left">string</td>
<td class="left">not yet</td>
<td class="left">don't know yet what makes sense here</td>
</tr>

<tr>
<td class="left"><b>Time</b></td>
<td class="left">&#xa0;</td>
<td class="left">time:Instant, nerd:Time</td>
<td class="left">TODO: can you parse to XSD datetime components?</td>
</tr>

<tr>
<td class="left">year</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">month</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">day</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">time</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">weekday</td>
<td class="left">stirng</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">rel</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
<td class="left">relative expression, eg "the last three days"</td>
</tr>

<tr>
<td class="left">other</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
<td class="left">any other time expression, eg "Valentine's day"</td>
</tr>

<tr>
<td class="left"><b>Amount</b></td>
<td class="left">type=price</td>
<td class="left">gr:UnitPriceSpecification, nerd:Amount</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">unit</td>
<td class="left">string</td>
<td class="left">gr:hasCurrency</td>
<td class="left">Assume that for price, that is a currency</td>
</tr>

<tr>
<td class="left">amount</td>
<td class="left">number</td>
<td class="left">gr:hasCurrencyValue</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Amount</b></td>
<td class="left">type=unit</td>
<td class="left">nerd:Amount, gr:QuantitativeValue</td>
<td class="left">How about percentage??</td>
</tr>

<tr>
<td class="left">unit</td>
<td class="left">string</td>
<td class="left">gr:hasUnitOfMeasurement</td>
<td class="left">Strictly speaking, UN/CEFACT Common Code (eg GRM for grams)</td>
</tr>

<tr>
<td class="left">amount</td>
<td class="left">number</td>
<td class="left">gr:hasValue</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Name</b></td>
<td class="left">&#xa0;</td>
<td class="left">nerd:Thing</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">type</td>
<td class="left">string</td>
<td class="left">dc:type</td>
<td class="left">a type if anything can be identified, otherwise empty</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Notes &amp; Todo <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Classes are uppercase, Properties are lowercase
</li>
<li>NERD classes are attached to the word using itsrdf:taClassRef
</li>
<li>Other classes are attached to the NE node (itsrdf:taIdentRef) using rdf:type.
</li>
</ul>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> gender</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>rdau:gender is literal with no predefined values, but male/female are more usual than masculine/feminine
</li>
<li>Check possible values of dbo:gender, and use that if possible
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> dc:type</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is a literal. Can we attach it to the word, or need to make a NE node?
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> schema.org</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Schema incorporates GoodRelations whole.
</li>
<li>Maybe redo all this using schema.org instead of DBO, FOAF, RDAu.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> GoodRelations</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Can we distinguish between gr:QuantitativeValue(Float|Integer), respectively hasValue(Float|Integer)?
</li>
<li>Update for GoodRelations v2
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014-11-19</p>
<p class="author">Author: vladimir.alexiev@ontotext.com</p>
<p class="date">Created: 2014-11-19 Wed 19:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.91.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
